app/controllers/events_controller.rb

SELECT * FROM "events"
---
  def index
    @events = Event.all

INSERT INTO "events" ("name", "location", "created_at", "ews_item_id", "end_datetime", "updated_at", "start_datetime", "description", "attendee_addresses", "target_mailbox") VALUES('Tim Test Event', 'RaddOnline', '2010-03-23 18:53:50', 'AAATAENsaWZ0b24uTGlAdWNzZi5lZHUARgAAAAAARULCRTXoTk+ZnH79+Ph7RAcAouvHxMlL/kyjU285Voej+wAO1/dQ7QAAouvHxMlL/kyjU285Voej+wAYC00zCQAA', '2010-03-23 18:52:00', '2010-03-23 18:53:50', '2010-03-23 08:52:00', 'When you get this ignore it. I am testing a EWS feature for a blog post.', 'ellen@raddonline.com
---
  def create
    @event = Event.new(params[:event])
    create_ews_event
    if @event.save

SELECT * FROM "events" WHERE ("events"."id" = 11)
---
  def edit
    @event = Event.find(params[:id])

SELECT * FROM "events" WHERE ("events"."id" = 11)
UPDATE "events" SET "updated_at" = '2010-03-23 00:26:02', "end_datetime" = '2010-03-22 13:24:00', "ews_item_id" = 'AAATAENsaWZ0b24uTGlAdWNzZi5lZHUARgAAAAAARULCRTXoTk+ZnH79+Ph7RAcAouvHxMlL/kyjU285Voej+wAO1/dQ7QAAouvHxMlL/kyjU285Voej+wAYC00y/wAA', "description" = 'This is a test event. Please ignore it. After editing.' WHERE "id" = 11
---
  def update
    @event = Event.find(params[:id])
    # First, destroy the original event that as created.
    destroy_ews_event

    if @event.update_attributes(params[:event])

SELECT * FROM "events" WHERE ("events"."id" = 3)
DELETE FROM "events" WHERE "id" = 3
---
  def destroy
    @event = Event.find(params[:id])
    destroy_ews_event
    @event.destroy